<a href="https://colab.research.google.com/github/Mildredkulei7/Moringa_Prep_week4/blob/main/Copy_of_Data_Investigation_with_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<font color="green">*To start working on this notebook, or any other notebook that we will use in the Moringa Data Science Course, we will need to save our own copy of it. We can do this by clicking File > Save a Copy in Drive. We will then be able to make edits to our own copy of this notebook.*</font>

# Data Investigation with Pandas

## 1.0 Importing our Libraries

In [ ]:
# Importing the libraries we will need 

# Importing the pandas library
# 
import pandas as pd

# Importing the numpy library
#
import numpy as np

## 1.1 Reading the Dataset from our CSV file



The dataset we will use contains information about the 2009 Census - The Rural Urban Population by Age, Sex and District.


*   Dataset link for download or access: [Link](https://drive.google.com/open?id=1pc9ZLFGsosdWBk1lI29ADIqRtCvD_FBe)

In [ ]:
# Let's read the data from the CSV file and create the dataframe to be used
# 
df = pd.read_csv("Rural_Urban_Population_By_Age_Sex_and_by_District__2009.csv")
df

           District Urban/Rural Age_years  ...   County  Province  OBJECTID
0      NAIROBI WEST       Urban         0  ...  Nairobi   NAIROBI         0
1      NAIROBI WEST       Urban         1  ...  Nairobi   NAIROBI         1
2      NAIROBI WEST       Urban         2  ...  Nairobi   NAIROBI         2
3      NAIROBI WEST       Urban         3  ...  Nairobi   NAIROBI         3
4      NAIROBI WEST       Urban         4  ...  Nairobi   NAIROBI         4
...             ...         ...       ...  ...      ...       ...       ...
25415    TESO SOUTH       Rural        77  ...    Busia   WESTERN     25415
25416    TESO SOUTH       Rural        78  ...    Busia   WESTERN     25416
25417    TESO SOUTH       Rural        79  ...    Busia   WESTERN     25417
25418    TESO SOUTH       Rural       80+  ...    Busia   WESTERN     25418
25419    TESO SOUTH       Rural    Age NS  ...    Busia   WESTERN     25419

[25420 rows x 9 columns]

## 1.2 Previewing our Dataset

In [ ]:
# Let's preview the first 10 rows of our data
# 
df.head(10)

       District Urban/Rural Age_years   Male  ...  Total   County Province OBJECTID
0  NAIROBI WEST       Urban         0  10126  ...  20242  Nairobi  NAIROBI        0
1  NAIROBI WEST       Urban         1   8124  ...  16113  Nairobi  NAIROBI        1
2  NAIROBI WEST       Urban         2   8462  ...  17089  Nairobi  NAIROBI        2
3  NAIROBI WEST       Urban         3   8334  ...  16754  Nairobi  NAIROBI        3
4  NAIROBI WEST       Urban         4   7948  ...  15768  Nairobi  NAIROBI        4
5  NAIROBI WEST       Urban         5   7547  ...  15207  Nairobi  NAIROBI        5
6  NAIROBI WEST       Urban         6   6966  ...  14048  Nairobi  NAIROBI        6
7  NAIROBI WEST       Urban         7   6511  ...  13185  Nairobi  NAIROBI        7
8  NAIROBI WEST       Urban         8   6171  ...  12660  Nairobi  NAIROBI        8
9  NAIROBI WEST       Urban         9   6361  ...  13023  Nairobi  NAIROBI        9

[10 rows x 9 columns]

## 1.3 Accessing Information about our Dataset

In [ ]:
# We can getting to know more about the dataset by accessing its information 
#
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25420 entries, 0 to 25419
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   District     25420 non-null  object
 1   Urban/Rural  25420 non-null  object
 2   Age_years    25420 non-null  object
 3   Male         25420 non-null  int64
 4   Female       25420 non-null  int64
 5   Total        25420 non-null  int64
 6   County       25420 non-null  object
 7   Province     25420 non-null  object
 8   OBJECTID     25420 non-null  int64
dtypes: int64(4), object(5)
memory usage: 1.7+ MB

## 1.4 Answering Questions

Let's answer the following questions with our dataset

In [ ]:
# Challenge 1
# What was the average age of a person of Kenya?
#
from sklearn.preprocessing import LabelEncoder
label_encoder = LabelEncoder()

label_encoder.fit(df['Age_years'])

LabelEncoder()

In [ ]:
list(label_encoder.classes_)

['0',
 '1',
 '10',
 '11',
 '12',
 '13',
 '14',
 '15',
 '16',
 '17',
 '18',
 '19',
 '2',
 '20',
 '21',
 '22',
 '23',
 '24',
 '25',
 '26',
 '27',
 '28',
 '29',
 '3',
 '30',
 '31',
 '32',
 '33',
 '34',
 '35',
 '36',
 '37',
 '38',
 '39',
 '4',
 '40',
 '41',
 '42',
 '43',
 '44',
 '45',
 '46',
 '47',
 '48',
 '49',
 '5',
 '50',
 '51',
 '52',
 '53',
 '54',
 '55',
 '56',
 '57',
 '58',
 '59',
 '6',
 '60',
 '61',
 '62',
 '63',
 '64',
 '65',
 '66',
 '67',
 '68',
 '69',
 '7',
 '70',
 '71',
 '72',
 '73',
 '74',
 '75',
 '76',
 '77',
 '78',
 '79',
 '8',
 '80+',
 '9',
 'Age NS']

In [ ]:
df['Age_years'] = label_encoder.transform(df['Age_years'])
df

/usr/local/lib/python3.7/dist-packages/numpy/lib/arraysetops.py:576: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  mask &= (ar1 != a)

ValueError: ignored

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25420 entries, 0 to 25419
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   District     25420 non-null  object
 1   Urban/Rural  25420 non-null  object
 2   Age_years    25420 non-null  int64
 3   Male         25420 non-null  int64
 4   Female       25420 non-null  int64
 5   Total        25420 non-null  int64
 6   County       25420 non-null  object
 7   Province     25420 non-null  object
 8   OBJECTID     25420 non-null  int64
dtypes: int64(5), object(4)
memory usage: 1.7+ MB

The column "Age_years" has changed its data type from "object" to "integer" which will allow us tocalcullate its avarage

In [ ]:
df.Age_years.mean()

40.5

In [ ]:
# Challenge 2
# What was the average female population in Kenya?
#
df.Female.mean()

763.8725019669552

In [ ]:
# Challenge 3
# What was the average male population in Kenya?
#
df.Male.mean()

755.0140833988985

In [ ]:
# Challenge 4
# Which 5 districts were the most densely populated Kenya in descending order?
#
df_d=df.groupby(['District']).sum().sort_values('Total', ascending=False)
df_d

                Age_years    Male  Female    Total  OBJECTID  distriect
District
NAIROBI EAST         3321  582554  561862  1144416     10045  1747434.5
NAIROBI NORTH        3321  545701  516385  1062086     16769  1774297.0
NAIROBI WEST         3321  352227  332538   684765      3321  1726610.5
SIAYA                6642  257711  292513   550224   2009943  2659673.0
MOLO                 6642  271954  270149   542103   2723138  2887278.0
...                   ...     ...     ...      ...       ...        ...
SAMBURU NORTH        6642   31471   28330    59801   2400386  1336660.5
SAMBURU EAST         6642   29011   30083    59094   2386938  1412174.0
MARSABIT             6642   23305   23197    46502   1485922  1344228.5
GARBATULLA           6642   23314   19804    43118   1553162  1251345.0
LAIKIPIA NORTH       6642   16928   15834    32762   2642450   967776.0

[158 rows x 6 columns]

The 5 most densely poulated District in kenya in descending order is

*   NAIROBI EAST

*   NAIROBI NORTH

*   NAIROBI WEST
*   SIAYA


*   MOLO

In [ ]:
# Challenge 5
# Which 5 counties were the most densely populated Counties in descending order?
# 
df_d=df.groupby(['County']).sum().sort_values('Total', ascending=False)
df_d.head(10)

          Age_years     Male   Female    Total  OBJECTID   distriect
County
Nairobi       13284  1605230  1533139  3138369     53628   6830218.0
Kiambu        59778   827800   845985  1673785  11208021  16733365.5
Kakamega      46494   800989   859662  1660651  20554694  14436079.5
Nakuru        26568   804582   798743  1603325  10811864  11006435.0
Meru          46494   786220   805313  1591533  11248678  14461298.0
Bungoma       33210   671548   703515  1375063  15229450  11845949.5
Kisii         33210   602947   660612  1263559  11060570  11295001.0
Kilifi        19926   535526   574209  1109735   4175358   7946748.0
Machakos      26568   543139   555445  1098584   7100216   8939910.0
Mandera       19926   559943   465813  1025756   5950943   6824928.0

The 5 counties that were the most densely populated Counties in descending order


*   Nairobi

*   Kiambu

*   Kakamega
*   Nakuru


*   Meru

In [ ]:
# Challenge 6
# Which 5 districts were the most sparsely populated in descending order?
# 
df_d=df.groupby(['District']).sum().sort_values('Total',ascending=True)
df_d.head(10)

                Age_years   Male  Female  Total  OBJECTID  distriect
District
LAIKIPIA NORTH       6642  16928   15834  32762   2642450   967776.0
GARBATULLA           6642  23314   19804  43118   1553162  1251345.0
MARSABIT             6642  23305   23197  46502   1485922  1344228.5
SAMBURU EAST         6642  29011   30083  59094   2386938  1412174.0
SAMBURU NORTH        6642  31471   28330  59801   2400386  1336660.5
LAISAMIS             6642  32198   33471  65669   1512818  1382573.0
BUNYALA              6642  31718   35005  66723   3126578  1418602.5
TAVETA               6642  35019   32646  67665   1472474  1601934.0
BORABU               6642  37079   36347  73426   2279354  1430843.0
CHALBI               6642  41318   33878  75196   1499370  1148281.0

The 5 districts that were the most sparsely populated 
in descending order



*   LAIKIPIA NORTH

*   GARBATULLA

*   MARSABIT	
*   SAMBURU EAST


*   SAMBURU NORTH

In [ ]:
# Challenge 7
# What was the average population of the the most densely populated county in Kenya?
# 
df=df[df['County'] == 'Nairobi']
df.Total.mean()

9568.198170731708

Nairobi            9568.198171

In [ ]:
# Challenge 8
# What was the average population of the the most sparsely populated county in Kenya?
# 
df=df[df['County'] == 'Laikipia']
df.Total.mean()

811.4369918699186

Laikipia            811.436992

In [ ]:
# Challenge 9
# What was the total population of Busia County? 
# 
df_bus = df[df['County'] == 'Busia']
df_bus.groupby(['County']).sum()

        Age_years    Male  Female   Total  OBJECTID  distriect
County
Busia       33210  356122  387824  743946  15565650  9003438.5

In [ ]:
# Challenge 10
# What was the average age of person in Busia County? How many people of this age were in Busia County?
# 
df_bus = df[df['County'] == 'Busia']
df_bus.groupby(['County']).mean()

        Age_years        Male      Female      Total  OBJECTID     distriect
County
Busia        40.5  434.295122  472.956098  907.25122   18982.5  10979.803049

In [ ]:
#How many people of this age were in Busia County?
df_bus2 = df[(df['County'] == 'Busia') & (df['Age_years'] == 40)]
df_bus2.Total.sum()

5860

In [ ]:
# Challenge 11
# What was the Total population of Teso South District?
# 
df_tes = df[df['District'] == 'TESO SOUTH']
df_tes.Total.sum()

137924

In [ ]:
# Challenge 12
# What was the urban population of Teso South District?
# 
t_south = df[(df['District'] == 'TESO SOUTH') & (df['Urban/Rural'] == 'Urban')]
t_south.Total.sum()

26162

In [ ]:
# Challenge 13
# What was the rural population of Teso South District?
# 
t_south2 = df[(df['District'] == 'TESO SOUTH') & (df['Urban/Rural'] == 'Rural')]
t_south2.Total.sum()

111762

In [ ]:
# Challenge 14
# What was the population of people aged 60 and above in Kenya?
#
urban_pop = df[df['Age_years'] >= 60]
urban_pop.Total.sum()

4770344

In [ ]:
# Challenge 15 
# What was the urban population in Kenya?
#
urban_pop = df[df['Urban/Rural'] == 'Urban']
urban_pop.Total.sum()

12487375